Feature: Добавяне на студент

  Scenario: Добавяне на студент
    Given Потребителя отваря екран за добавяне на студент
    When  Въвежда фн "1801321029"
    And   Въвежда име на студента "Nadia"
    And   Въвежда курс "3"
    And   Въвежда егн "9909014504"
    And   Въвежда телефон "0896405068"
    And   Натиска бутона за добавяне на студент 
   Then   Вижда съобщение "Успешно добавяне"

 Scenario: Добавяне на студент с дублиран фн
    Given Потребителя отваря екран за добавяне на студент
    When  Въвежда фн "1801321029"
    And   Въвежда име на студента "Ivo"
    And   Въвежда курс "3"
    And   Въвежда егн "9009014504"
    And   Въвежда телефон "0896415068"
    And   Натиска бутона за добавяне на студент 
   Then   Вижда съобщение "Студент с такъв фн вече съществува."
   
Scenario: Добавяне на студент с задължителни полета
    Given Потребителя отваря екран за добавяне на студент
    When  Въвежда фн "1801321021"
    And   Въвежда име на студента ""
    And   Въвежда курс "3"
    And   Въвежда егн ""
    And   Въвежда телефон "0896540235"
    And   Натиска бутона за добавяне на студент 
   Then   Вижда съобщение "Всички полета с * са задължителни"
   
  